Autodesk.Revit.DB.Plumbing.PipeScheduleType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new pipe schedule type with the given name.
Remarks:
If the name is already taken by an existing schedule type, an InvalidOperationException will be thrown.
doc:
The document
name:
The name of requested schedule type.
Returns:
Returns the newly created schedule type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The name is already taken by an existing pipe schedule type.
Since:
2017